docs/QuickStart.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-06 Fri 10:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=1024, initial-scale=1" />
<title>MRPTree Quick Start &amp; FAQ</title>
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Minimal tutorial for getting started with MRPTree" />
<meta name="keywords" content="KEYWORDS FIXME" />
<meta name="generator" content="Org Mode" />












</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://github.com/richmit/MRPTree/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">MRPTree Quick Start &amp; FAQ</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Copyright &copy; 2025 Mitch Richling. All rights reserved.</td>
</tr>
</tbody>
</table>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#intro">1. <b><code>MRPtree</code></b> Quick Start</a>
<ul>
<li><a href="#build-wcmake">1.1. Building <b><code>MRPtree</code></b> Examples With <code>CMake</code></a></li>
<li><a href="#build-wocmake">1.2. Building <b><code>MRPtree</code></b> Examples Without <code>CMake</code></a></li>
</ul>
</li>
<li><a href="#faq">2. <b><code>MRPtree</code></b> FAQ</a>
<ul>
<li><a href="#orgb78b320">2.1. Do I <i>need</i> <code>MRaster</code> to use <code>MRPTree</code>.</a></li>
<li><a href="#org63fd428">2.2. Do I <i>need</i> <code>MRMathCPP</code> to use <code>MRPTree</code>.</a></li>
<li><a href="#org61fbff5">2.3. Do you recommend using the <code>MR_cell_cplx</code> or <code>MR_rt_to_cc</code> outside of the provided examples?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-intro" class="outline-2">
<h2 id="intro"><span class="section-number-2">1.</span> <b><code>MRPtree</code></b> Quick Start</h2>
<div class="outline-text-2" id="text-intro">
<p>
The best place to start with <b><code>MRPtree</code></b> is the example programs.  
</p>
</div>
<div id="outline-container-build-wcmake" class="outline-3">
<h3 id="build-wcmake"><span class="section-number-3">1.1.</span> Building <b><code>MRPtree</code></b> Examples With <code>CMake</code></h3>
<div class="outline-text-3" id="text-build-wcmake">
<p>
The <b><code>MRPtree</code></b> code is broken into <b>two</b> repositories (<b><code>MRPtree</code></b> &amp; <b><code>MRMathCPP</code></b>), and both must be downloaded and configured before you can use
<b><code>MRPtree</code></b>.  In addition, some of the example programs use <b><code>MRaster</code></b>.  If you want to build those examples, then you will also need to download and
configure <b><code>MRaster</code></b>.
</p>

<p>
A typical shell session to download, configure everything, and build the examples might look like this:
</p>

<div class="org-src-container">
<pre class="src src-sh">git clone <span style="color: #fa8072;">'https://github.com/richmit/MRMathCPP.git'</span>    <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Download MRMathCPP</span>
<span style="color: #b0c4de;">cd</span> MRMathCPP/build                                      <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Change directory to 'build'</span>
cmake ..                                                <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Configure the build system with cmake</span>
<span style="color: #b0c4de;">cd</span> ../..                                                <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Change directory back to where we started</span>
git clone <span style="color: #fa8072;">'https://github.com/richmit/mraster.git'</span>      <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Download MRaster</span>
<span style="color: #b0c4de;">cd</span> mraster/build                                        <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Change directory to 'build'</span>
cmake ..                                                <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Configure the build system with cmake</span>
<span style="color: #b0c4de;">cd</span> ../..                                                <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Change directory back to where we started</span>
git clone <span style="color: #fa8072;">'https://github.com/richmit/MRPTree.git'</span>      <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Download MRPTree</span>
<span style="color: #b0c4de;">cd</span> MRPTree/build                                        <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Change directory into the repo's build directory</span>
cmake ..                                                <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Configure build</span>
cmake --build . -t examples-all                         <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Build all the examples</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-build-wocmake" class="outline-3">
<h3 id="build-wocmake"><span class="section-number-3">1.2.</span> Building <b><code>MRPtree</code></b> Examples Without <code>CMake</code></h3>
<div class="outline-text-3" id="text-build-wocmake">
<p>
<b><code>MRPtree</code></b> and all of it's dependencies are single-header C++ libraries.  So using them really just amounts to making sure your compiler
an find the headers.  
</p>

<p>
Our first step is to get the code.  A typical shell session to download everything might look like this:
</p>

<div class="org-src-container">
<pre class="src src-sh">git clone <span style="color: #fa8072;">'https://github.com/richmit/MRMathCPP.git'</span>    <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Download MRMathCPP</span>
git clone <span style="color: #fa8072;">'https://github.com/richmit/mraster.git'</span>      <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Download MRaster</span>
git clone <span style="color: #fa8072;">'https://github.com/richmit/MRPTree.git'</span>      <span style="color: #ffa500;"># </span><span style="color: #ff7f24;">Download MRPTree</span>
</pre>
</div>

<p>
Here is a brief outline of what we have downloaded:
</p>
<dl class="org-dl">
<dt><code>MRMathCPP/lib/</code>           </dt><dd>Headers for <code>MRMathCPP</code></dd>
<dt><code>mraster/lib</code>              </dt><dd>Headers for <code>MRaster</code></dd>
<dt><code>MRPTree/lib/</code>             </dt><dd>Headers for <code>MRPTree</code></dd>
<dt><code>MRPTree/examples-lib3d/</code>  </dt><dd>Headers for <code>MRPTree</code> examples</dd>
<dt><code>MRPTree/examples-func-viz</code></dt><dd>The most interesting <code>MRPTree</code> example programs</dd>
</dl>

<p>
What you do next will depend upon your development environment.  For example, if we are using GCC on a UNIX-like environment, then we might do something like
this:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> MRPTree/examples-func-viz
g++ -std=c++23 -I../lib/ -I../../MRMathCPP/lib/ -I../examples-lib3d/ -I../../mraster/lib/ -o complex_magnitude_surface complex_magnitude_surface.cpp
</pre>
</div>

<p>
This will build <code>complex_magnitude_surface</code> on UNIX'ish platforms and <code>complex_magnitude_surface.exe</code> on windows (under MSYS2 for example).  Of the several
examples, I selected <code>complex_magnitude_surface.cpp</code> as it uses all of the dependencies, including <code>MRaster</code> &#x2013; so it's a good test if we got everything
right.
</p>

<p>
If using an IDE, then the standard procedure is to create a project and simply add the source file for the example in question along with all the headers to
the project.
</p>
</div>
</div>
</div>
<div id="outline-container-faq" class="outline-2">
<h2 id="faq"><span class="section-number-2">2.</span> <b><code>MRPtree</code></b> FAQ</h2>
<div class="outline-text-2" id="text-faq">
</div>
<div id="outline-container-orgb78b320" class="outline-3">
<h3 id="orgb78b320"><span class="section-number-3">2.1.</span> Do I <i>need</i> <code>MRaster</code> to use <code>MRPTree</code>.</h3>
<div class="outline-text-3" id="text-2-1">
<p>
No.  I use <code>MRaster</code> in some of the example programs to generate color schemes or bitmaps.  <code>MRPTree</code> has no direct dependency on this library at all.
</p>
</div>
</div>
<div id="outline-container-org63fd428" class="outline-3">
<h3 id="org63fd428"><span class="section-number-3">2.2.</span> Do I <i>need</i> <code>MRMathCPP</code> to use <code>MRPTree</code>.</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Yes.  <code>MRPTree</code> directly uses several of the functions in  <code>MRMathCPP</code>.
</p>
</div>
</div>
<div id="outline-container-org61fbff5" class="outline-3">
<h3 id="org61fbff5"><span class="section-number-3">2.3.</span> Do you recommend using the <code>MR_cell_cplx</code> or <code>MR_rt_to_cc</code> outside of the provided examples?</h3>
<div class="outline-text-3" id="text-2-3">
<p>
No.
</p>

<p>
These libraries are quite minimal &#x2013; they really are just barely enough to support useful examples. Any real application using <code>MRPTree</code> would be much better
served using something like VTK for 3D geometry.
</p>

<p>
These libraries are housed in a directory called "<code>examples-lib3d</code>" to emphasize the point they are <b>NOT</b> part of the primary library.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
</div>
</body>
</html>
